### DataFrame

In [47]:
import pandas as pd
import numpy as np

In [48]:
# CRUD : Create Read Update Delete

#### 1. 데이터 프레임 객체 생성
- 리스트 안에 딕셔너리로 생성
    - `[{},{},{}]` : `{column:value, ...}` > row
- 딕셔너리 안에 리스트로 생성
    - `{column1: [values], column2: [values]}` : `column1:[values]` > column

In [49]:
# 리스트의 딕셔너리

In [50]:
datas = [
    {"name": "data", "email": "data@gmail.com", "id": 1},
    {"name": "python", "email": "python@naver.com", "id": 2},
]
datas

[{'name': 'data', 'email': 'data@gmail.com', 'id': 1},
 {'name': 'python', 'email': 'python@naver.com', 'id': 2}]

In [51]:
df = pd.DataFrame(datas)
df

     name             email  id
0    data    data@gmail.com   1
1  python  python@naver.com   2

In [52]:
# 딕셔너리의 리스트

In [53]:
datas = df.to_dict("list")
datas

{'name': ['data', 'python'],
 'email': ['data@gmail.com', 'python@naver.com'],
 'id': [1, 2]}

In [54]:
datas = {'name': ['data', 'python', "jupyter"],
         'email': ['data@gmail.com', 'python@naver.com', 'jupyter@daum.net'],
         'id': [1, 2, 3]}

In [55]:
df = pd.DataFrame(datas)
df

      name             email  id
0     data    data@gmail.com   1
1   python  python@naver.com   2
2  jupyter  jupyter@daum.net   3

In [56]:
# 데이터 프레임의 변수 확인 : index, values, columns

In [57]:
df

      name             email  id
0     data    data@gmail.com   1
1   python  python@naver.com   2
2  jupyter  jupyter@daum.net   3

In [58]:
df.index, df.columns, df.values

(RangeIndex(start=0, stop=3, step=1),
 Index(['name', 'email', 'id'], dtype='object'),
 array([['data', 'data@gmail.com', 1],
        ['python', 'python@naver.com', 2],
        ['jupyter', 'jupyter@daum.net', 3]], dtype=object))

In [59]:
df.index = list("ABC")
df

      name             email  id
A     data    data@gmail.com   1
B   python  python@naver.com   2
C  jupyter  jupyter@daum.net   3

In [60]:
df.dtypes

name     object
email    object
id        int64
dtype: object

#### 2. 데이터의 선택, 수정, 추가, 삭제

In [61]:
# 데이터 선택 : row, column, [row, column]

In [62]:
df.index = [0, 1, 2]
df

      name             email  id
0     data    data@gmail.com   1
1   python  python@naver.com   2
2  jupyter  jupyter@daum.net   3

In [63]:
# row : df.loc[]
df.loc[::-1]

      name             email  id
2  jupyter  jupyter@daum.net   3
1   python  python@naver.com   2
0     data    data@gmail.com   1

In [64]:
df.loc[[0, 2]]

      name             email  id
0     data    data@gmail.com   1
2  jupyter  jupyter@daum.net   3

In [65]:
# column : []

In [66]:
df

      name             email  id
0     data    data@gmail.com   1
1   python  python@naver.com   2
2  jupyter  jupyter@daum.net   3

In [67]:
df[["id", "name", "email"]]

   id     name             email
0   1     data    data@gmail.com
1   2   python  python@naver.com
2   3  jupyter  jupyter@daum.net

In [68]:
# [row, column] : df.loc[row, column]

In [69]:
df.loc[::2, ["id", "email"]]

   id             email
0   1    data@gmail.com
2   3  jupyter@daum.net

In [70]:
# 데이터 수정 : 데이터 선택 = 수정하는 데이터

In [71]:
df

      name             email  id
0     data    data@gmail.com   1
1   python  python@naver.com   2
2  jupyter  jupyter@daum.net   3

In [72]:
df["id"] = [4, 5, 6]
df

      name             email  id
0     data    data@gmail.com   4
1   python  python@naver.com   5
2  jupyter  jupyter@daum.net   6

In [73]:
np.array([["notebook", 7], ["macbook", 8]])

array([['notebook', '7'],
       ['macbook', '8']], dtype='<U8')

In [74]:
df.loc[1:, ["name", "id"]] = [["notebook", 7], ["macbook", 8]]
df

       name             email  id
0      data    data@gmail.com   4
1  notebook  python@naver.com   7
2   macbook  jupyter@daum.net   8

In [75]:
# 데이터 추가 : column, row

In [76]:
# row

In [77]:
len(df)

3

In [78]:
df.loc[len(df)] = ["iphone", "iphone@daum.net", 9]
df

       name             email  id
0      data    data@gmail.com   4
1  notebook  python@naver.com   7
2   macbook  jupyter@daum.net   8
3    iphone   iphone@daum.net   9

In [79]:
# column

In [80]:
df["addr"] = ["seoul", "pusan", "incheon", "anyang"]
df

       name             email  id     addr
0      data    data@gmail.com   4    seoul
1  notebook  python@naver.com   7    pusan
2   macbook  jupyter@daum.net   8  incheon
3    iphone   iphone@daum.net   9   anyang

In [81]:
# 데이터 삭제 : df.drop()

In [82]:
df.drop(index=[3], columns=["addr"])

       name             email  id
0      data    data@gmail.com   4
1  notebook  python@naver.com   7
2   macbook  jupyter@daum.net   8

In [83]:
df.columns[:-1]

Index(['name', 'email', 'id'], dtype='object')

In [84]:
df.loc[0:2, df.columns[:-1]]

       name             email  id
0      data    data@gmail.com   4
1  notebook  python@naver.com   7
2   macbook  jupyter@daum.net   8

In [85]:
df.loc[:-1]

Empty DataFrame
Columns: [name, email, id, addr]
Index: []

In [86]:
df.iloc[:-1]

       name             email  id     addr
0      data    data@gmail.com   4    seoul
1  notebook  python@naver.com   7    pusan
2   macbook  jupyter@daum.net   8  incheon

#### startup file 설정
- `$ ipython profile create`
- `$ cd ~/.ipython/profile_default/startup`

#### 데이터프레임 함수들

In [87]:
# 1. apply : Series 객체에 있는 함수
# 특정 컬럼의 데이터를 하나씩 함수를 실행한 결과 데이터로 출력

In [88]:
def get_domain(email):
    return email.split("@")[1].split(".")[0]

get_domain("data@gmail.com")

'gmail'

In [89]:
df["domail"] = df["email"].apply(lambda email: email.split("@")[1].split(".")[0])
df

       name             email  id     addr domail
0      data    data@gmail.com   4    seoul  gmail
1  notebook  python@naver.com   7    pusan  naver
2   macbook  jupyter@daum.net   8  incheon   daum
3    iphone   iphone@daum.net   9   anyang   daum

In [90]:
# 실습 데이터 프레임 만들기

In [91]:
!ls datas

makedata.py       preprocessing.csv seoul.csv         train.csv

In [92]:
import datas.makedata as md

In [93]:
md.get_name(), md.get_age()

('Anchal', 30)

In [94]:
datas = md.make_data(5)
df = pd.DataFrame(datas)
df

   Age    Name
0   37  Anchal
1   34  Arnold
2   30   Billy
3   29  Anchal
4   32  Arnold

In [95]:
# df.append() : 두개의 데이터 프레임을 합칠때 사용

In [96]:
df1 = pd.DataFrame(md.make_data(5))
df2 = pd.DataFrame(md.make_data(5))

In [97]:
df3 = df1.append(df2)
df3.head(2)

   Age   Name
0   33   Alan
1   29  Alvin

In [98]:
df3.tail(2)

   Age  Name
3   30  Alan
4   36  Adam

In [99]:
# df.reset_index()
df3.reset_index(drop=True, inplace=True)

In [100]:
df3

   Age    Name
0   33    Alan
1   29   Alvin
2   28    Alan
3   34    Alex
4   24    Alex
5   24    Alan
6   31  Arnold
7   20  Andrew
8   30    Alan
9   36    Adam

In [101]:
df1.append(df2, ignore_index=True)

   Age    Name
0   33    Alan
1   29   Alvin
2   28    Alan
3   34    Alex
4   24    Alex
5   24    Alan
6   31  Arnold
7   20  Andrew
8   30    Alan
9   36    Adam

In [102]:
# pd.concat() : row나 column으로 데이터를 합쳐줄때 사용

In [103]:
df3 = pd.concat([df1, df2]).reset_index(drop=True)
df3

   Age    Name
0   33    Alan
1   29   Alvin
2   28    Alan
3   34    Alex
4   24    Alex
5   24    Alan
6   31  Arnold
7   20  Andrew
8   30    Alan
9   36    Adam

In [104]:
pd.concat([df3, df1], axis=1)

   Age    Name   Age   Name
0   33    Alan  33.0   Alan
1   29   Alvin  29.0  Alvin
2   28    Alan  28.0   Alan
3   34    Alex  34.0   Alex
4   24    Alex  24.0   Alex
5   24    Alan   NaN    NaN
6   31  Arnold   NaN    NaN
7   20  Andrew   NaN    NaN
8   30    Alan   NaN    NaN
9   36    Adam   NaN    NaN

In [105]:
pd.concat([df3, df1], axis=1, join="inner")

   Age   Name  Age   Name
0   33   Alan   33   Alan
1   29  Alvin   29  Alvin
2   28   Alan   28   Alan
3   34   Alex   34   Alex
4   24   Alex   24   Alex

In [106]:
# df.groupby()
# 특정 컬럼의 중복되는 row 데이터를 합쳐서 새로운 데이터 프레임으로 만드는 방법
# 중복되는 데이터를 합칠때 결합함수를 사용해서 합쳐줍니다.
# 결합함수 : size, min, max, mean, sum ...

In [107]:
df = pd.DataFrame(md.make_data())
df.tail(2)

   Age  Name
8   37  Adam
9   40  Alan

In [108]:
df.groupby("Name").size().reset_index(name="counts")

      Name  counts
0     Adam       3
1     Alan       1
2     Alex       1
3    Alvin       1
4   Andrew       1
5  Anthony       1
6   Arnold       1
7    Billy       1

In [111]:
df2 = df.groupby("Name").agg(["count", "min", "max"]).reset_index()
df2

      Name   Age
           count min max
0     Adam     3  29  37
1     Alan     1  40  40
2     Alex     1  20  20
3    Alvin     1  23  23
4   Andrew     1  39  39
5  Anthony     1  35  35
6   Arnold     1  30  30
7    Billy     1  25  25

In [112]:
df.groupby("Name").agg(["count", "min", "max"]).reset_index()

      Name   Age
           count min max
0     Adam     3  29  37
1     Alan     1  40  40
2     Alex     1  20  20
3    Alvin     1  23  23
4   Andrew     1  39  39
5  Anthony     1  35  35
6   Arnold     1  30  30
7    Billy     1  25  25

In [113]:
df2.loc[5]["Age"]["count"]

1

In [114]:
df2.columns = ["name", "count", "min", "max"]
df2

      name  count  min  max
0     Adam      3   29   37
1     Alan      1   40   40
2     Alex      1   20   20
3    Alvin      1   23   23
4   Andrew      1   39   39
5  Anthony      1   35   35
6   Arnold      1   30   30
7    Billy      1   25   25

In [115]:
# df.describe() 데이터를 요약해서 출력

In [116]:
df2.describe()

          count        min        max
count  8.000000   8.000000   8.000000
mean   1.250000  30.125000  31.125000
std    0.707107   7.376362   7.735586
min    1.000000  20.000000  20.000000
25%    1.000000  24.500000  24.500000
50%    1.000000  29.500000  32.500000
75%    1.000000  36.000000  37.500000
max    3.000000  40.000000  40.000000

In [117]:
#df.rename(): 컬럼명을 변경

In [120]:
df2.rename(columns = {"min":"minimum","max":"maximum"},inplace=True)

In [121]:
df2

      name  count  minimum  maximum
0     Adam      3       29       37
1     Alan      1       40       40
2     Alex      1       20       20
3    Alvin      1       23       23
4   Andrew      1       39       39
5  Anthony      1       35       35
6   Arnold      1       30       30
7    Billy      1       25       25

###merge = sql에서 join과 같음
- 두개이상의 데이터 프레임을 특정 컬럼을 기준으로 합쳐서 출력하는 방법

In [123]:
addr_df = pd.DataFrame([
    {"name":"A" , "addr" : "Seoul"},
    {"name":"B" , "addr" : "Busan"},
    {"name":"C" , "addr" : "Inchoen"}
])

In [124]:
addr_df

  name     addr
0    A    Seoul
1    B    Busan
2    C  Inchoen

In [125]:
population_df = pd.DataFrame({
    "addr" : ["Seoul","Busan","Incheon"],
    "population" : [1000,300,200]
})

In [126]:
population_df

      addr  population
0    Seoul        1000
1    Busan         300
2  Incheon         200

In [127]:
addr_df.merge(population_df)

  name   addr  population
0    A  Seoul        1000
1    B  Busan         300

In [131]:
#user df 만들기 : 중복되는 이름이 없도록 만들어줘야함

In [138]:
user_df = pd.DataFrame(columns=["user_id","name","age"])
for user_id in range(1,9):
    name = md.get_name()
    while name in list(user_df["name"]):
        name = md.get_name()
    data = {"user_id" : user_id, "name" : name, "age": md.get_age()}
    user_df.loc[len(user_df)] = data

In [139]:
user_df

  user_id    name age
0       1  Arnold  31
1       2   Alvin  37
2       3  Andrew  39
3       4  Anchal  33
4       5     Jin  39
5       6    Alan  31
6       7   Billy  39
7       8    Alex  26

In [129]:
#money df 만들기

In [143]:
money_df = pd.DataFrame(columns=["id","income"])
for idx in range(15):
    income = np.random.randint(1,21) * 1000
    money_df.loc[len(money_df)] = {"id" : np.random.randint(1,9), "income": income}
ids = money_df["id"].unique()
ids.sort()
ids

array([1, 2, 3, 5, 7], dtype=object)

In [144]:
money_df

   id income
0   1  18000
1   2   7000
2   2   8000
3   7   1000
4   3   7000
5   3  20000
6   2   4000
7   3  10000
8   2  20000
9   3  14000
10  1   2000
11  2  15000
12  3   3000
13  5   4000
14  3   1000

In [130]:
#money df group by

In [145]:
user_i.columns, money_df.columns

AttributeError: 'int' object has no attribute 'columns'

In [146]:
money_df.merge(user_df,left_on="id",right_on = "user_id")

   id income user_id    name age
0   1  18000       1  Arnold  31
1   1   2000       1  Arnold  31
2   2   7000       2   Alvin  37
3   2   8000       2   Alvin  37
4   2   4000       2   Alvin  37
5   2  20000       2   Alvin  37
6   2  15000       2   Alvin  37
7   7   1000       7   Billy  39
8   3   7000       3  Andrew  39
9   3  20000       3  Andrew  39
10  3  10000       3  Andrew  39
11  3  14000       3  Andrew  39
12  3   3000       3  Andrew  39
13  3   1000       3  Andrew  39
14  5   4000       5     Jin  39

In [147]:
user_df.rename(columns={"user_id":"id"},inplace=True)

In [148]:
user_df

  id    name age
0  1  Arnold  31
1  2   Alvin  37
2  3  Andrew  39
3  4  Anchal  33
4  5     Jin  39
5  6    Alan  31
6  7   Billy  39
7  8    Alex  26

In [149]:
merged_df = pd.merge(user_df, money_df)
user_df.tail(2)

  id   name age
6  7  Billy  39
7  8   Alex  26

In [154]:
merged_df.groupby("name").agg("sum")["income"]

name
Alvin     54000
Andrew    55000
Arnold    20000
Billy      1000
Jin        4000
Name: income, dtype: int64

In [155]:
merged_df.groupby("name").agg("sum")["income"].reset_index()

     name  income
0   Alvin   54000
1  Andrew   55000
2  Arnold   20000
3   Billy    1000
4     Jin    4000

In [156]:
merged_df

   id    name age income
0   1  Arnold  31  18000
1   1  Arnold  31   2000
2   2   Alvin  37   7000
3   2   Alvin  37   8000
4   2   Alvin  37   4000
5   2   Alvin  37  20000
6   2   Alvin  37  15000
7   3  Andrew  39   7000
8   3  Andrew  39  20000
9   3  Andrew  39  10000
10  3  Andrew  39  14000
11  3  Andrew  39   3000
12  3  Andrew  39   1000
13  5     Jin  39   4000
14  7   Billy  39   1000

In [ ]:
#merge - outer

In [171]:
#fillna : NaN데이터를 채워주는 함수
merged_df = pd.merge(user_df, money_df,how="outer").fillna(value=0)
result_df = merged_df.groupby("name").agg("sum")["income"].reset_index()

In [166]:
merged_df

    id    name  age  income
0    1  Arnold   31   18000
1    1  Arnold   31    2000
2    2   Alvin   37    7000
3    2   Alvin   37    8000
4    2   Alvin   37    4000
5    2   Alvin   37   20000
6    2   Alvin   37   15000
7    3  Andrew   39    7000
8    3  Andrew   39   20000
9    3  Andrew   39   10000
10   3  Andrew   39   14000
11   3  Andrew   39    3000
12   3  Andrew   39    1000
13   4  Anchal   33       0
14   5     Jin   39    4000
15   6    Alan   31       0
16   7   Billy   39    1000
17   8    Alex   26       0

In [ ]:
# merge와 np.merge는 다름

In [ ]:
#user df, money df ->merge

In [175]:
#전치 : 행과 열을 바꿔줌
result_df

     name  income
0    Alan       0
1    Alex       0
2   Alvin   54000
3  Anchal       0
4  Andrew   55000
5  Arnold   20000
6   Billy    1000
7     Jin    4000

In [173]:
# isin : 자신이 원하는 데이터를 출력

In [176]:
idx = result_df.isin(["Alan","Billy",0])
idx

    name  income
0   True    True
1  False    True
2  False   False
3  False    True
4  False   False
5  False   False
6   True   False
7  False   False

In [181]:
idx.any(axis=1)
result_df[idx.any(axis=1)]

     name  income
0    Alan       0
1    Alex       0
3  Anchal       0
6   Billy    1000

In [182]:
# Series.str.contains : 특정 문자열이 포함된 데이터를 출력할때 사용

In [187]:
result_df[result_df["name"].str.contains("Al")]

    name  income
0   Alan       0
1   Alex       0
2  Alvin   54000

In [188]:
#날짜 데이터 타입

In [201]:
dates = pd.date_range("20201101",periods=100)

In [202]:
dates

DatetimeIndex(['2020-11-01', '2020-11-02', '2020-11-03', '2020-11-04',
               '2020-11-05', '2020-11-06', '2020-11-07', '2020-11-08',
               '2020-11-09', '2020-11-10', '2020-11-11', '2020-11-12',
               '2020-11-13', '2020-11-14', '2020-11-15', '2020-11-16',
               '2020-11-17', '2020-11-18', '2020-11-19', '2020-11-20',
               '2020-11-21', '2020-11-22', '2020-11-23', '2020-11-24',
               '2020-11-25', '2020-11-26', '2020-11-27', '2020-11-28',
               '2020-11-29', '2020-11-30', '2020-12-01', '2020-12-02',
               '2020-12-03', '2020-12-04', '2020-12-05', '2020-12-06',
               '2020-12-07', '2020-12-08', '2020-12-09', '2020-12-10',
               '2020-12-11', '2020-12-12', '2020-12-13', '2020-12-14',
               '2020-12-15', '2020-12-16', '2020-12-17', '2020-12-18',
               '2020-12-19', '2020-12-20', '2020-12-21', '2020-12-22',
               '2020-12-23', '2020-12-24', '2020-12-25', '2020-12-26',
               '2020-12-27', '2020-12-28', '2020-12-29', '2020-12-30',
               '2020-12-31', '2021-01-01', '2021-01-02', '2021-01-03',
               '2021-01-04', '2021-01-05', '2021-01-06', '2021-01-07',
               '2021-01-08', '2021-01-09', '2021-01-10', '2021-01-11',
               '2021-01-12', '2021-01-13', '2021-01-14', '2021-01-15',
               '2021-01-16', '2021-01-17', '2021-01-18', '2021-01-19',
               '2021-01-20', '2021-01-21', '2021-01-22', '2021-01-23',
               '2021-01-24', '2021-01-25', '2021-01-26', '2021-01-27',
               '2021-01-28', '2021-01-29', '2021-01-30', '2021-01-31',
               '2021-02-01', '2021-02-02', '2021-02-03', '2021-02-04',
               '2021-02-05', '2021-02-06', '2021-02-07', '2021-02-08'],
              dtype='datetime64[ns]', freq='D')

In [203]:
df = pd.DataFrame(np.random.randint(-5,5,size=(100,4)), columns = list("ABCD"), index=dates)

In [204]:
df

            A  B  C  D
2020-11-01 -3 -3 -2  2
2020-11-02 -1  3 -5 -4
2020-11-03 -4 -4 -4  1
2020-11-04  2  4  1 -4
2020-11-05  1  0  0 -4
...        .. .. .. ..
2021-02-04  2 -4 -2  4
2021-02-05 -4 -4 -5  4
2021-02-06 -5  1 -4 -2
2021-02-07 -4 -4  3  2
2021-02-08 -2  4  3 -3

[100 rows x 4 columns]

In [205]:
#2020년 3월 20일 이후의 데이터 선택

In [206]:
df[df.index >= "20200320"].head()

            A  B  C  D
2020-11-01 -3 -3 -2  2
2020-11-02 -1  3 -5 -4
2020-11-03 -4 -4 -4  1
2020-11-04  2  4  1 -4
2020-11-05  1  0  0 -4

In [207]:
# 연도별 groupby

In [209]:
df.groupby(dates.year).mean()

             A         B         C         D
2020 -0.442623 -0.131148 -0.114754 -0.770492
2021 -0.256410  0.692308 -0.461538  0.076923

In [210]:
#월별 groupby

In [213]:
month = dates.to_period("M")
month

PeriodIndex(['2020-11', '2020-11', '2020-11', '2020-11', '2020-11', '2020-11',
             '2020-11', '2020-11', '2020-11', '2020-11', '2020-11', '2020-11',
             '2020-11', '2020-11', '2020-11', '2020-11', '2020-11', '2020-11',
             '2020-11', '2020-11', '2020-11', '2020-11', '2020-11', '2020-11',
             '2020-11', '2020-11', '2020-11', '2020-11', '2020-11', '2020-11',
             '2020-12', '2020-12', '2020-12', '2020-12', '2020-12', '2020-12',
             '2020-12', '2020-12', '2020-12', '2020-12', '2020-12', '2020-12',
             '2020-12', '2020-12', '2020-12', '2020-12', '2020-12', '2020-12',
             '2020-12', '2020-12', '2020-12', '2020-12', '2020-12', '2020-12',
             '2020-12', '2020-12', '2020-12', '2020-12', '2020-12', '2020-12',
             '2020-12', '2021-01', '2021-01', '2021-01', '2021-01', '2021-01',
             '2021-01', '2021-01', '2021-01', '2021-01', '2021-01', '2021-01',
             '2021-01', '2021-01', '2021-01', '2021-01', '2021-01', '2021-01',
             '2021-01', '2021-01', '2021-01', '2021-01', '2021-01', '2021-01',
             '2021-01', '2021-01', '2021-01', '2021-01', '2021-01', '2021-01',
             '2021-01', '2021-01', '2021-02', '2021-02', '2021-02', '2021-02',
             '2021-02', '2021-02', '2021-02', '2021-02'],
            dtype='period[M]', freq='M')

In [214]:
df.groupby(month).mean()

                A         B         C         D
2020-11 -1.066667 -0.233333  0.000000 -0.833333
2020-12  0.161290 -0.032258 -0.225806 -0.709677
2021-01 -0.129032  1.193548 -0.451613 -0.096774
2021-02 -0.750000 -1.250000 -0.500000  0.750000

In [215]:
df = pd.DataFrame({
    "name" : ["jin","peter","po"],
    "blood" : ["A","B","AB"]
})

In [216]:
df

    name blood
0    jin     A
1  peter     B
2     po    AB

In [220]:
replace_map = {"A" : "good","B":"normal","AB":"bad"}
df["blood"] = df["blood"].map(replace_map)

In [221]:
df

    name   blood
0    jin    good
1  peter  normal
2     po     bad